# 04 - Grouping

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [130]:
users = pd.read_table('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. Discover what is the mean age per occupation

In [131]:
users[['occupation', 'age']].groupby('occupation').mean()

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [132]:
users['gender_to_binary'] = users['gender'].apply(lambda x: 1 if x== 'M' else 0) 
# Asigno un valor 1 al hombre y un 0 a la columna mujer para contar solo los hombres cuando llame a la función suma y añado estos valores como una nueva columna en el DataFrame

In [133]:
ratio = users.groupby('occupation').sum()['gender_to_binary'] / users['occupation'].value_counts()
# Genero una serie que sea el resultado de dividir el numero de hombres por profesión entre el total de personas por profesión
ratio = ratio * 100
ratio.sort_values(ascending=False)

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [134]:
users.groupby('occupation').agg(('min', 'max'))['age']

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [135]:
users.groupby(['occupation', 'gender']).mean().loc[:, 'age']

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [136]:
# Usamos los resultados del ejercicio 5 
occupation = pd.DataFrame()
occupation['male_percentage'] = ratio
occupation['female_percentage'] = 100 - ratio
occupation

               male_percentage  female_percentage
administrator        54.430380          45.569620
artist               53.571429          46.428571
doctor              100.000000           0.000000
educator             72.631579          27.368421
engineer             97.014925           2.985075
entertainment        88.888889          11.111111
executive            90.625000           9.375000
healthcare           31.250000          68.750000
homemaker            14.285714          85.714286
lawyer               83.333333          16.666667
librarian            43.137255          56.862745
marketing            61.538462          38.461538
none                 55.555556          44.444444
other                65.714286          34.285714
programmer           90.909091           9.090909
retired              92.857143           7.142857
salesman             75.000000          25.000000
scientist            90.322581           9.677419
student              69.387755          30.612245
technician           96.296296           3.703704
writer               57.777778          42.222222

### Enlace a github: https://github.com/JoseKuru/bootcamp/blob/main/week4_EDA_np_pd_json_apis_regex/day3_numpy_pandas_III_json/exercises/pandas/04_Grouping/Occupation/Occupation%20Grouping.ipynb